; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p14---int100n150-m25---int100c110---s482---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 - fuellevel
)

(:init
(sum level0 level6 level6)
(sum level0 level9 level9)
(sum level0 level11 level11)
(sum level0 level13 level13)
(sum level0 level15 level15)
(sum level0 level19 level19)
(sum level0 level21 level21)
(sum level0 level25 level25)
(sum level1 level6 level7)
(sum level1 level9 level10)
(sum level1 level11 level12)
(sum level1 level13 level14)
(sum level1 level15 level16)
(sum level1 level19 level20)
(sum level1 level21 level22)
(sum level1 level25 level26)
(sum level2 level6 level8)
(sum level2 level9 level11)
(sum level2 level11 level13)
(sum level2 level13 level15)
(sum level2 level15 level17)
(sum level2 level19 level21)
(sum level2 level21 level23)
(sum level2 level25 level27)
(sum level3 level6 level9)
(sum level3 level9 level12)
(sum level3 level11 level14)
(sum level3 level13 level16)
(sum level3 level15 level18)
(sum level3 level19 level22)
(sum level3 level21 level24)
(sum level3 level25 level28)
(sum level4 level6 level10)
(sum level4 level9 level13)
(sum level4 level11 level15)
(sum level4 level13 level17)
(sum level4 level15 level19)
(sum level4 level19 level23)
(sum level4 level21 level25)
(sum level4 level25 level29)
(sum level5 level6 level11)
(sum level5 level9 level14)
(sum level5 level11 level16)
(sum level5 level13 level18)
(sum level5 level15 level20)
(sum level5 level19 level24)
(sum level5 level21 level26)
(sum level5 level25 level30)
(sum level6 level6 level12)
(sum level6 level9 level15)
(sum level6 level11 level17)
(sum level6 level13 level19)
(sum level6 level15 level21)
(sum level6 level19 level25)
(sum level6 level21 level27)
(sum level6 level25 level31)
(sum level7 level6 level13)
(sum level7 level9 level16)
(sum level7 level11 level18)
(sum level7 level13 level20)
(sum level7 level15 level22)
(sum level7 level19 level26)
(sum level7 level21 level28)
(sum level7 level25 level32)
(sum level8 level6 level14)
(sum level8 level9 level17)
(sum level8 level11 level19)
(sum level8 level13 level21)
(sum level8 level15 level23)
(sum level8 level19 level27)
(sum level8 level21 level29)
(sum level8 level25 level33)
(sum level9 level6 level15)
(sum level9 level9 level18)
(sum level9 level11 level20)
(sum level9 level13 level22)
(sum level9 level15 level24)
(sum level9 level19 level28)
(sum level9 level21 level30)
(sum level9 level25 level34)
(sum level10 level6 level16)
(sum level10 level9 level19)
(sum level10 level11 level21)
(sum level10 level13 level23)
(sum level10 level15 level25)
(sum level10 level19 level29)
(sum level10 level21 level31)
(sum level10 level25 level35)
(sum level11 level6 level17)
(sum level11 level9 level20)
(sum level11 level11 level22)
(sum level11 level13 level24)
(sum level11 level15 level26)
(sum level11 level19 level30)
(sum level11 level21 level32)
(sum level11 level25 level36)
(sum level12 level6 level18)
(sum level12 level9 level21)
(sum level12 level11 level23)
(sum level12 level13 level25)
(sum level12 level15 level27)
(sum level12 level19 level31)
(sum level12 level21 level33)
(sum level12 level25 level37)
(sum level13 level6 level19)
(sum level13 level9 level22)
(sum level13 level11 level24)
(sum level13 level13 level26)
(sum level13 level15 level28)
(sum level13 level19 level32)
(sum level13 level21 level34)
(sum level13 level25 level38)
(sum level14 level6 level20)
(sum level14 level9 level23)
(sum level14 level11 level25)
(sum level14 level13 level27)
(sum level14 level15 level29)
(sum level14 level19 level33)
(sum level14 level21 level35)
(sum level14 level25 level39)
(sum level15 level6 level21)
(sum level15 level9 level24)
(sum level15 level11 level26)
(sum level15 level13 level28)
(sum level15 level15 level30)
(sum level15 level19 level34)
(sum level15 level21 level36)
(sum level15 level25 level40)
(sum level16 level6 level22)
(sum level16 level9 level25)
(sum level16 level11 level27)
(sum level16 level13 level29)
(sum level16 level15 level31)
(sum level16 level19 level35)
(sum level16 level21 level37)
(sum level16 level25 level41)
(sum level17 level6 level23)
(sum level17 level9 level26)
(sum level17 level11 level28)
(sum level17 level13 level30)
(sum level17 level15 level32)
(sum level17 level19 level36)
(sum level17 level21 level38)
(sum level17 level25 level42)
(sum level18 level6 level24)
(sum level18 level9 level27)
(sum level18 level11 level29)
(sum level18 level13 level31)
(sum level18 level15 level33)
(sum level18 level19 level37)
(sum level18 level21 level39)
(sum level18 level25 level43)
(sum level19 level6 level25)
(sum level19 level9 level28)
(sum level19 level11 level30)
(sum level19 level13 level32)
(sum level19 level15 level34)
(sum level19 level19 level38)
(sum level19 level21 level40)
(sum level19 level25 level44)
(sum level20 level6 level26)
(sum level20 level9 level29)
(sum level20 level11 level31)
(sum level20 level13 level33)
(sum level20 level15 level35)
(sum level20 level19 level39)
(sum level20 level21 level41)
(sum level20 level25 level45)
(sum level21 level6 level27)
(sum level21 level9 level30)
(sum level21 level11 level32)
(sum level21 level13 level34)
(sum level21 level15 level36)
(sum level21 level19 level40)
(sum level21 level21 level42)
(sum level21 level25 level46)
(sum level22 level6 level28)
(sum level22 level9 level31)
(sum level22 level11 level33)
(sum level22 level13 level35)
(sum level22 level15 level37)
(sum level22 level19 level41)
(sum level22 level21 level43)
(sum level22 level25 level47)
(sum level23 level6 level29)
(sum level23 level9 level32)
(sum level23 level11 level34)
(sum level23 level13 level36)
(sum level23 level15 level38)
(sum level23 level19 level42)
(sum level23 level21 level44)
(sum level23 level25 level48)
(sum level24 level6 level30)
(sum level24 level9 level33)
(sum level24 level11 level35)
(sum level24 level13 level37)
(sum level24 level15 level39)
(sum level24 level19 level43)
(sum level24 level21 level45)
(sum level24 level25 level49)
(sum level25 level6 level31)
(sum level25 level9 level34)
(sum level25 level11 level36)
(sum level25 level13 level38)
(sum level25 level15 level40)
(sum level25 level19 level44)
(sum level25 level21 level46)
(sum level25 level25 level50)
(sum level26 level6 level32)
(sum level26 level9 level35)
(sum level26 level11 level37)
(sum level26 level13 level39)
(sum level26 level15 level41)
(sum level26 level19 level45)
(sum level26 level21 level47)
(sum level26 level25 level51)
(sum level27 level6 level33)
(sum level27 level9 level36)
(sum level27 level11 level38)
(sum level27 level13 level40)
(sum level27 level15 level42)
(sum level27 level19 level46)
(sum level27 level21 level48)
(sum level27 level25 level52)
(sum level28 level6 level34)
(sum level28 level9 level37)
(sum level28 level11 level39)
(sum level28 level13 level41)
(sum level28 level15 level43)
(sum level28 level19 level47)
(sum level28 level21 level49)
(sum level28 level25 level53)
(sum level29 level6 level35)
(sum level29 level9 level38)
(sum level29 level11 level40)
(sum level29 level13 level42)
(sum level29 level15 level44)
(sum level29 level19 level48)
(sum level29 level21 level50)
(sum level29 level25 level54)
(sum level30 level6 level36)
(sum level30 level9 level39)
(sum level30 level11 level41)
(sum level30 level13 level43)
(sum level30 level15 level45)
(sum level30 level19 level49)
(sum level30 level21 level51)
(sum level30 level25 level55)
(sum level31 level6 level37)
(sum level31 level9 level40)
(sum level31 level11 level42)
(sum level31 level13 level44)
(sum level31 level15 level46)
(sum level31 level19 level50)
(sum level31 level21 level52)
(sum level31 level25 level56)
(sum level32 level6 level38)
(sum level32 level9 level41)
(sum level32 level11 level43)
(sum level32 level13 level45)
(sum level32 level15 level47)
(sum level32 level19 level51)
(sum level32 level21 level53)
(sum level32 level25 level57)
(sum level33 level6 level39)
(sum level33 level9 level42)
(sum level33 level11 level44)
(sum level33 level13 level46)
(sum level33 level15 level48)
(sum level33 level19 level52)
(sum level33 level21 level54)
(sum level33 level25 level58)
(sum level34 level6 level40)
(sum level34 level9 level43)
(sum level34 level11 level45)
(sum level34 level13 level47)
(sum level34 level15 level49)
(sum level34 level19 level53)
(sum level34 level21 level55)
(sum level34 level25 level59)
(sum level35 level6 level41)
(sum level35 level9 level44)
(sum level35 level11 level46)
(sum level35 level13 level48)
(sum level35 level15 level50)
(sum level35 level19 level54)
(sum level35 level21 level56)
(sum level35 level25 level60)
(sum level36 level6 level42)
(sum level36 level9 level45)
(sum level36 level11 level47)
(sum level36 level13 level49)
(sum level36 level15 level51)
(sum level36 level19 level55)
(sum level36 level21 level57)
(sum level36 level25 level61)
(sum level37 level6 level43)
(sum level37 level9 level46)
(sum level37 level11 level48)
(sum level37 level13 level50)
(sum level37 level15 level52)
(sum level37 level19 level56)
(sum level37 level21 level58)
(sum level37 level25 level62)
(sum level38 level6 level44)
(sum level38 level9 level47)
(sum level38 level11 level49)
(sum level38 level13 level51)
(sum level38 level15 level53)
(sum level38 level19 level57)
(sum level38 level21 level59)
(sum level38 level25 level63)
(sum level39 level6 level45)
(sum level39 level9 level48)
(sum level39 level11 level50)
(sum level39 level13 level52)
(sum level39 level15 level54)
(sum level39 level19 level58)
(sum level39 level21 level60)
(sum level39 level25 level64)
(sum level40 level6 level46)
(sum level40 level9 level49)
(sum level40 level11 level51)
(sum level40 level13 level53)
(sum level40 level15 level55)
(sum level40 level19 level59)
(sum level40 level21 level61)
(sum level40 level25 level65)
(sum level41 level6 level47)
(sum level41 level9 level50)
(sum level41 level11 level52)
(sum level41 level13 level54)
(sum level41 level15 level56)
(sum level41 level19 level60)
(sum level41 level21 level62)
(sum level41 level25 level66)
(sum level42 level6 level48)
(sum level42 level9 level51)
(sum level42 level11 level53)
(sum level42 level13 level55)
(sum level42 level15 level57)
(sum level42 level19 level61)
(sum level42 level21 level63)
(sum level42 level25 level67)
(sum level43 level6 level49)
(sum level43 level9 level52)
(sum level43 level11 level54)
(sum level43 level13 level56)
(sum level43 level15 level58)
(sum level43 level19 level62)
(sum level43 level21 level64)
(sum level43 level25 level68)
(sum level44 level6 level50)
(sum level44 level9 level53)
(sum level44 level11 level55)
(sum level44 level13 level57)
(sum level44 level15 level59)
(sum level44 level19 level63)
(sum level44 level21 level65)
(sum level44 level25 level69)
(sum level45 level6 level51)
(sum level45 level9 level54)
(sum level45 level11 level56)
(sum level45 level13 level58)
(sum level45 level15 level60)
(sum level45 level19 level64)
(sum level45 level21 level66)
(sum level45 level25 level70)
(sum level46 level6 level52)
(sum level46 level9 level55)
(sum level46 level11 level57)
(sum level46 level13 level59)
(sum level46 level15 level61)
(sum level46 level19 level65)
(sum level46 level21 level67)
(sum level46 level25 level71)
(sum level47 level6 level53)
(sum level47 level9 level56)
(sum level47 level11 level58)
(sum level47 level13 level60)
(sum level47 level15 level62)
(sum level47 level19 level66)
(sum level47 level21 level68)
(sum level47 level25 level72)
(sum level48 level6 level54)
(sum level48 level9 level57)
(sum level48 level11 level59)
(sum level48 level13 level61)
(sum level48 level15 level63)
(sum level48 level19 level67)
(sum level48 level21 level69)
(sum level48 level25 level73)
(sum level49 level6 level55)
(sum level49 level9 level58)
(sum level49 level11 level60)
(sum level49 level13 level62)
(sum level49 level15 level64)
(sum level49 level19 level68)
(sum level49 level21 level70)
(sum level49 level25 level74)
(sum level50 level6 level56)
(sum level50 level9 level59)
(sum level50 level11 level61)
(sum level50 level13 level63)
(sum level50 level15 level65)
(sum level50 level19 level69)
(sum level50 level21 level71)
(sum level50 level25 level75)
(sum level51 level6 level57)
(sum level51 level9 level60)
(sum level51 level11 level62)
(sum level51 level13 level64)
(sum level51 level15 level66)
(sum level51 level19 level70)
(sum level51 level21 level72)
(sum level51 level25 level76)
(sum level52 level6 level58)
(sum level52 level9 level61)
(sum level52 level11 level63)
(sum level52 level13 level65)
(sum level52 level15 level67)
(sum level52 level19 level71)
(sum level52 level21 level73)
(sum level52 level25 level77)
(sum level53 level6 level59)
(sum level53 level9 level62)
(sum level53 level11 level64)
(sum level53 level13 level66)
(sum level53 level15 level68)
(sum level53 level19 level72)
(sum level53 level21 level74)
(sum level53 level25 level78)
(sum level54 level6 level60)
(sum level54 level9 level63)
(sum level54 level11 level65)
(sum level54 level13 level67)
(sum level54 level15 level69)
(sum level54 level19 level73)
(sum level54 level21 level75)
(sum level54 level25 level79)
(sum level55 level6 level61)
(sum level55 level9 level64)
(sum level55 level11 level66)
(sum level55 level13 level68)
(sum level55 level15 level70)
(sum level55 level19 level74)
(sum level55 level21 level76)
(sum level55 level25 level80)
(sum level56 level6 level62)
(sum level56 level9 level65)
(sum level56 level11 level67)
(sum level56 level13 level69)
(sum level56 level15 level71)
(sum level56 level19 level75)
(sum level56 level21 level77)
(sum level56 level25 level81)
(sum level57 level6 level63)
(sum level57 level9 level66)
(sum level57 level11 level68)
(sum level57 level13 level70)
(sum level57 level15 level72)
(sum level57 level19 level76)
(sum level57 level21 level78)
(sum level57 level25 level82)
(sum level58 level6 level64)
(sum level58 level9 level67)
(sum level58 level11 level69)
(sum level58 level13 level71)
(sum level58 level15 level73)
(sum level58 level19 level77)
(sum level58 level21 level79)
(sum level58 level25 level83)
(sum level59 level6 level65)
(sum level59 level9 level68)
(sum level59 level11 level70)
(sum level59 level13 level72)
(sum level59 level15 level74)
(sum level59 level19 level78)
(sum level59 level21 level80)
(sum level59 level25 level84)
(sum level60 level6 level66)
(sum level60 level9 level69)
(sum level60 level11 level71)
(sum level60 level13 level73)
(sum level60 level15 level75)
(sum level60 level19 level79)
(sum level60 level21 level81)
(sum level60 level25 level85)
(sum level61 level6 level67)
(sum level61 level9 level70)
(sum level61 level11 level72)
(sum level61 level13 level74)
(sum level61 level15 level76)
(sum level61 level19 level80)
(sum level61 level21 level82)
(sum level61 level25 level86)
(sum level62 level6 level68)
(sum level62 level9 level71)
(sum level62 level11 level73)
(sum level62 level13 level75)
(sum level62 level15 level77)
(sum level62 level19 level81)
(sum level62 level21 level83)
(sum level62 level25 level87)
(sum level63 level6 level69)
(sum level63 level9 level72)
(sum level63 level11 level74)
(sum level63 level13 level76)
(sum level63 level15 level78)
(sum level63 level19 level82)
(sum level63 level21 level84)
(sum level63 level25 level88)
(sum level64 level6 level70)
(sum level64 level9 level73)
(sum level64 level11 level75)
(sum level64 level13 level77)
(sum level64 level15 level79)
(sum level64 level19 level83)
(sum level64 level21 level85)
(sum level64 level25 level89)
(sum level65 level6 level71)
(sum level65 level9 level74)
(sum level65 level11 level76)
(sum level65 level13 level78)
(sum level65 level15 level80)
(sum level65 level19 level84)
(sum level65 level21 level86)
(sum level65 level25 level90)
(sum level66 level6 level72)
(sum level66 level9 level75)
(sum level66 level11 level77)
(sum level66 level13 level79)
(sum level66 level15 level81)
(sum level66 level19 level85)
(sum level66 level21 level87)
(sum level66 level25 level91)
(sum level67 level6 level73)
(sum level67 level9 level76)
(sum level67 level11 level78)
(sum level67 level13 level80)
(sum level67 level15 level82)
(sum level67 level19 level86)
(sum level67 level21 level88)
(sum level67 level25 level92)
(sum level68 level6 level74)
(sum level68 level9 level77)
(sum level68 level11 level79)
(sum level68 level13 level81)
(sum level68 level15 level83)
(sum level68 level19 level87)
(sum level68 level21 level89)
(sum level68 level25 level93)
(sum level69 level6 level75)
(sum level69 level9 level78)
(sum level69 level11 level80)
(sum level69 level13 level82)
(sum level69 level15 level84)
(sum level69 level19 level88)
(sum level69 level21 level90)
(sum level69 level25 level94)
(sum level70 level6 level76)
(sum level70 level9 level79)
(sum level70 level11 level81)
(sum level70 level13 level83)
(sum level70 level15 level85)
(sum level70 level19 level89)
(sum level70 level21 level91)
(sum level70 level25 level95)
(sum level71 level6 level77)
(sum level71 level9 level80)
(sum level71 level11 level82)
(sum level71 level13 level84)
(sum level71 level15 level86)
(sum level71 level19 level90)
(sum level71 level21 level92)
(sum level71 level25 level96)
(sum level72 level6 level78)
(sum level72 level9 level81)
(sum level72 level11 level83)
(sum level72 level13 level85)
(sum level72 level15 level87)
(sum level72 level19 level91)
(sum level72 level21 level93)
(sum level72 level25 level97)
(sum level73 level6 level79)
(sum level73 level9 level82)
(sum level73 level11 level84)
(sum level73 level13 level86)
(sum level73 level15 level88)
(sum level73 level19 level92)
(sum level73 level21 level94)
(sum level73 level25 level98)
(sum level74 level6 level80)
(sum level74 level9 level83)
(sum level74 level11 level85)
(sum level74 level13 level87)
(sum level74 level15 level89)
(sum level74 level19 level93)
(sum level74 level21 level95)
(sum level74 level25 level99)
(sum level75 level6 level81)
(sum level75 level9 level84)
(sum level75 level11 level86)
(sum level75 level13 level88)
(sum level75 level15 level90)
(sum level75 level19 level94)
(sum level75 level21 level96)
(sum level75 level25 level100)
(sum level76 level6 level82)
(sum level76 level9 level85)
(sum level76 level11 level87)
(sum level76 level13 level89)
(sum level76 level15 level91)
(sum level76 level19 level95)
(sum level76 level21 level97)
(sum level76 level25 level101)
(sum level77 level6 level83)
(sum level77 level9 level86)
(sum level77 level11 level88)
(sum level77 level13 level90)
(sum level77 level15 level92)
(sum level77 level19 level96)
(sum level77 level21 level98)
(sum level77 level25 level102)
(sum level78 level6 level84)
(sum level78 level9 level87)
(sum level78 level11 level89)
(sum level78 level13 level91)
(sum level78 level15 level93)
(sum level78 level19 level97)
(sum level78 level21 level99)
(sum level78 level25 level103)
(sum level79 level6 level85)
(sum level79 level9 level88)
(sum level79 level11 level90)
(sum level79 level13 level92)
(sum level79 level15 level94)
(sum level79 level19 level98)
(sum level79 level21 level100)
(sum level79 level25 level104)
(sum level80 level6 level86)
(sum level80 level9 level89)
(sum level80 level11 level91)
(sum level80 level13 level93)
(sum level80 level15 level95)
(sum level80 level19 level99)
(sum level80 level21 level101)
(sum level80 level25 level105)
(sum level81 level6 level87)
(sum level81 level9 level90)
(sum level81 level11 level92)
(sum level81 level13 level94)
(sum level81 level15 level96)
(sum level81 level19 level100)
(sum level81 level21 level102)
(sum level81 level25 level106)
(sum level82 level6 level88)
(sum level82 level9 level91)
(sum level82 level11 level93)
(sum level82 level13 level95)
(sum level82 level15 level97)
(sum level82 level19 level101)
(sum level82 level21 level103)
(sum level82 level25 level107)
(sum level83 level6 level89)
(sum level83 level9 level92)
(sum level83 level11 level94)
(sum level83 level13 level96)
(sum level83 level15 level98)
(sum level83 level19 level102)
(sum level83 level21 level104)
(sum level83 level25 level108)
(sum level84 level6 level90)
(sum level84 level9 level93)
(sum level84 level11 level95)
(sum level84 level13 level97)
(sum level84 level15 level99)
(sum level84 level19 level103)
(sum level84 level21 level105)
(sum level84 level25 level109)
(sum level85 level6 level91)
(sum level85 level9 level94)
(sum level85 level11 level96)
(sum level85 level13 level98)
(sum level85 level15 level100)
(sum level85 level19 level104)
(sum level85 level21 level106)
(sum level85 level25 level110)
(sum level86 level6 level92)
(sum level86 level9 level95)
(sum level86 level11 level97)
(sum level86 level13 level99)
(sum level86 level15 level101)
(sum level86 level19 level105)
(sum level86 level21 level107)
(sum level86 level25 level111)
(sum level87 level6 level93)
(sum level87 level9 level96)
(sum level87 level11 level98)
(sum level87 level13 level100)
(sum level87 level15 level102)
(sum level87 level19 level106)
(sum level87 level21 level108)
(sum level87 level25 level112)
(sum level88 level6 level94)
(sum level88 level9 level97)
(sum level88 level11 level99)
(sum level88 level13 level101)
(sum level88 level15 level103)
(sum level88 level19 level107)
(sum level88 level21 level109)
(sum level88 level25 level113)
(sum level89 level6 level95)
(sum level89 level9 level98)
(sum level89 level11 level100)
(sum level89 level13 level102)
(sum level89 level15 level104)
(sum level89 level19 level108)
(sum level89 level21 level110)
(sum level90 level6 level96)
(sum level90 level9 level99)
(sum level90 level11 level101)
(sum level90 level13 level103)
(sum level90 level15 level105)
(sum level90 level19 level109)
(sum level90 level21 level111)
(sum level91 level6 level97)
(sum level91 level9 level100)
(sum level91 level11 level102)
(sum level91 level13 level104)
(sum level91 level15 level106)
(sum level91 level19 level110)
(sum level91 level21 level112)
(sum level92 level6 level98)
(sum level92 level9 level101)
(sum level92 level11 level103)
(sum level92 level13 level105)
(sum level92 level15 level107)
(sum level92 level19 level111)
(sum level92 level21 level113)
(sum level93 level6 level99)
(sum level93 level9 level102)
(sum level93 level11 level104)
(sum level93 level13 level106)
(sum level93 level15 level108)
(sum level93 level19 level112)
(sum level94 level6 level100)
(sum level94 level9 level103)
(sum level94 level11 level105)
(sum level94 level13 level107)
(sum level94 level15 level109)
(sum level94 level19 level113)
(sum level95 level6 level101)
(sum level95 level9 level104)
(sum level95 level11 level106)
(sum level95 level13 level108)
(sum level95 level15 level110)
(sum level96 level6 level102)
(sum level96 level9 level105)
(sum level96 level11 level107)
(sum level96 level13 level109)
(sum level96 level15 level111)
(sum level97 level6 level103)
(sum level97 level9 level106)
(sum level97 level11 level108)
(sum level97 level13 level110)
(sum level97 level15 level112)
(sum level98 level6 level104)
(sum level98 level9 level107)
(sum level98 level11 level109)
(sum level98 level13 level111)
(sum level98 level15 level113)
(sum level99 level6 level105)
(sum level99 level9 level108)
(sum level99 level11 level110)
(sum level99 level13 level112)
(sum level100 level6 level106)
(sum level100 level9 level109)
(sum level100 level11 level111)
(sum level100 level13 level113)
(sum level101 level6 level107)
(sum level101 level9 level110)
(sum level101 level11 level112)
(sum level102 level6 level108)
(sum level102 level9 level111)
(sum level102 level11 level113)
(sum level103 level6 level109)
(sum level103 level9 level112)
(sum level104 level6 level110)
(sum level104 level9 level113)
(sum level105 level6 level111)
(sum level106 level6 level112)
(sum level107 level6 level113)

(connected l0 l1)
(fuelcost level21 l0 l1)
(connected l0 l4)
(fuelcost level6 l0 l4)
(connected l1 l0)
(fuelcost level21 l1 l0)
(connected l1 l2)
(fuelcost level25 l1 l2)
(connected l1 l5)
(fuelcost level9 l1 l5)
(connected l2 l1)
(fuelcost level25 l2 l1)
(connected l2 l3)
(fuelcost level11 l2 l3)
(connected l2 l5)
(fuelcost level13 l2 l5)
(connected l3 l2)
(fuelcost level11 l3 l2)
(connected l3 l4)
(fuelcost level15 l3 l4)
(connected l3 l5)
(fuelcost level19 l3 l5)
(connected l4 l0)
(fuelcost level6 l4 l0)
(connected l4 l3)
(fuelcost level15 l4 l3)
(connected l4 l5)
(fuelcost level15 l4 l5)
(connected l5 l1)
(fuelcost level9 l5 l1)
(connected l5 l2)
(fuelcost level13 l5 l2)
(connected l5 l3)
(fuelcost level19 l5 l3)
(connected l5 l4)
(fuelcost level15 l5 l4)

(at t0 l1)
(fuel t0 level113)
(= (total-cost) 0)

(at p0 l3)
(at p1 l4)
(at p2 l5)
(at p3 l5)
(at p4 l1)
(at p5 l5)
(at p6 l1)
(at p7 l4)
(at p8 l4)
(at p9 l5)
(at p10 l5)
(at p11 l1)
(at p12 l0)
(at p13 l3)
)

(:goal
(and
(at p0 l0)
(at p1 l0)
(at p2 l4)
(at p3 l4)
(at p4 l0)
(at p5 l1)
(at p6 l3)
(at p7 l3)
(at p8 l5)
(at p9 l2)
(at p10 l0)
(at p11 l5)
(at p12 l5)
(at p13 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 0 of 14
2. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 14
3. (load p11 t0 l1)
   deleted: (at p11 l1)
   added: (in p11 t0)
   goals met: 0 of 14
4. (drive t0 l1 l5 level104 level9 level113)
   deleted: (at t0 l1) (fuel t0 level113)
   added: (at t0 l5) (fuel t0 level104)
   goals met: 0 of 14
5. (load p5 t0 l5)
   deleted: (at p5 l5)
   added: (in p5 t0)
   goals met: 0 of 14
6. (load p3 t0 l5)
   deleted: (at p3 l5)
   added: (in p3 t0)
   goals met: 0 of 14
7. (load p2 t0 l5)
   deleted: (at p2 l5)
   added: (in p2 t0)
   goals met: 0 of 14
8. (load p10 t0 l5)
   deleted: (at p10 l5)
   added: (in p10 t0)
   goals met: 0 of 14
9. (drive t0 l5 l4 level89 level15 level104)
   deleted: (at t0 l5) (fuel t0 level104)
   added: (at t0 l4) (fuel t0 level89)
   goals met: 0 of 14
10. (load p7 t0 l4)
   deleted: (at p7 l4)
   added: (in p7 t0)
   goals met: 0 of 14
11. (load p1 t0 l4)
   deleted: (at p1 l4)
   added: (in p1 t0)
   goals met: 0 of 14
12. (drive t0 l4 l3 level74 level15 level89)
   deleted: (at t0 l4) (fuel t0 level89)
   added: (at t0 l3) (fuel t0 level74)
   goals met: 0 of 14
13. (unload p7 t0 l3)
   deleted: (in p7 t0)
   added: (at p7 l3)
   goals met: 1 of 14
14. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 2 of 14
15. (load p13 t0 l3)
   deleted: (at p13 l3)
   added: (in p13 t0)
   goals met: 2 of 14
16. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 2 of 14
17. (drive t0 l3 l4 level59 level15 level74)
   deleted: (at t0 l3) (fuel t0 level74)
   added: (at t0 l4) (fuel t0 level59)
   goals met: 2 of 14
18. (load p8 t0 l4)
   deleted: (at p8 l4)
   added: (in p8 t0)
   goals met: 2 of 14
19. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 3 of 14
20. (unload p3 t0 l4)
   deleted: (in p3 t0)
   added: (at p3 l4)
   goals met: 4 of 14
21. (drive t0 l4 l0 level53 level6 level59)
   deleted: (at t0 l4) (fuel t0 level59)
   added: (at t0 l0) (fuel t0 level53)
   goals met: 4 of 14
22. (load p12 t0 l0)
   deleted: (at p12 l0)
   added: (in p12 t0)
   goals met: 4 of 14
23. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 5 of 14
24. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 6 of 14
25. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 7 of 14
26. (unload p13 t0 l0)
   deleted: (in p13 t0)
   added: (at p13 l0)
   goals met: 8 of 14
27. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 9 of 14
28. (drive t0 l0 l1 level32 level21 level53)
   deleted: (at t0 l0) (fuel t0 level53)
   added: (at t0 l1) (fuel t0 level32)
   goals met: 9 of 14
29. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 10 of 14
30. (drive t0 l1 l5 level23 level9 level32)
   deleted: (at t0 l1) (fuel t0 level32)
   added: (at t0 l5) (fuel t0 level23)
   goals met: 10 of 14
31. (load p9 t0 l5)
   deleted: (at p9 l5)
   added: (in p9 t0)
   goals met: 10 of 14
32. (unload p11 t0 l5)
   deleted: (in p11 t0)
   added: (at p11 l5)
   goals met: 11 of 14
33. (unload p12 t0 l5)
   deleted: (in p12 t0)
   added: (at p12 l5)
   goals met: 12 of 14
34. (unload p8 t0 l5)
   deleted: (in p8 t0)
   added: (at p8 l5)
   goals met: 13 of 14
35. (drive t0 l5 l2 level10 level13 level23)
   deleted: (at t0 l5) (fuel t0 level23)
   added: (at t0 l2) (fuel t0 level10)
   goals met: 13 of 14
36. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 14 of 14
